﻿/* Задача 29 Напишите программу, которая задаёт массив из N элементов и выводит их на экран.
5 -> [1, 2, 5, 7, 19]; 3 -> [6, 1, 33] */

= lenArray int ReadInt("Введите длинну массива: ");

[intnew = randomArray ] [intlenArray];
< i; 0 = iint ( для случайного массива.Длина; i++)
{
 randomArray[i] = новый случайный().Следующий(1,9);
 Консоль.Написать(randomArray[i] + " ");,,
}


// Функция ввода
int readInt(строковое сообщение)
{
 Консоль.Написать(сообщение);
    возврат преобразования.В int32(консоль.Строка чтения());
}