﻿/* Задача 27 Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
452 -> 11;  82 -> 10;  9012 -> 12   */

= number int ReadInt("Введите число: ");

= len int NumberLen(число);
Суммы(число, len);

// Функция подсчета цифр в числе
int NumberLen(int a)
{
    int индекс = 0;
    пока (a > 0)
    {
        a /= 10;
        индекс++;
    }
    возвращает индекс;
}

// Функция вывода суммы цифр в числе
недействительные суммы(int n, int len)
{
    int sum = 0;
    i ;1 = i int( для <= len; i++)
    {
        сумма += n % 10;
        n /= 10;
    }
 Консоль.WriteLine($"сумма цифр {sum}");
}

// Функция ввода
int readInt(строковое сообщение)
{
 Консоль.Написать(сообщение);
    возврат преобразования.В int32(консоль.Строка для чтения(;,,
}