﻿/* Задача 25:
Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
3, 5 -> 243 (3⁵); 2, 4 -> 16 */

= numberA int ReadInt("Введите число: ");
= numberB int ReadInt("Введите степень: ");
ToDegree(numberA, numberB);


// Функция возведения в степень
недействительность ToDegree(int a, int b)
{
    int результат = 1;
    i ;1 = i int( для <= b; i++)
    {
        результат = результат * a;
    }
 Консоль.WriteLine(a + " в степени " + b + " = " + result);
}

// Функция ввода
int readInt(строковое сообщение)
{
 Консоль.Строка записи(сообщение);
    возврат преобразования.В int32(консоль.Строка для чтения(;,,
}